00_simpleFoam/system/streamlines_inlet
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

direction       both;

seedSampleSet
{
    type            cloud;
    cloud			streamlinesAutocadinlet
	{
	points
	(
	(0.16 0 1)
	(0.2166 0.4458 1)
	(0.3718 0.8669 1)
	(0.621 1.2402 1)
	(0.9504 1.5452 1)
	(1.3418 1.7648 1)
	(1.7737 1.8871 1)
	(2.2224 1.911 1)
	(2.6723 1.911 1)
	(3.1221 1.911 1)
	(3.572 1.911 1)
	(4.0219 1.911 1)
	(4.4718 1.911 1)
	(4.9217 1.911 1)
	(5.3716 1.911 1)
	(5.8215 1.911 1)
	(6.2714 1.911 1)
	(6.7213 1.911 1)
	(7.1712 1.911 1)
	(7.6211 1.911 1)
	);
	}
}

fields          (U);


// Must be last entry
#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
